### Connecting to Postgresql

In [1]:
# pip install sqlalchemy

In [2]:
# pip install psycopg2-binary

In [3]:
%load_ext sql
from sqlalchemy import create_engine

In [4]:
%sql postgresql://postgres:@localhost:5432/postgres

In [21]:
%%sql 
CREATE TABLE Movies6 (
    PosterLINK char(255),
    Movie char(255) PRIMARY KEY,
    Released_year int,
    Rating int,
    Runtime int,
    Genre char(255),
    Director char(255),
    Star1 char(255),
    Star2 char(255),
    Star3 char(255),
    Star4 char(255),
    Copies_available int,
    prices int
    )

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [22]:
%%sql 
INSERT INTO Movies6 ( PosterLINK, Movie , Released_year, Rating, Runtime , Genre , Director , star1 , Star2 , Star3 , Star4 , Copies_available , prices)
VALUES  ( 
    'lnk',
    'temn',
    1994, 
    9.3,
    142,
    'Drama',
    'Frank Darabont',
    'Tim Robbins',
    'Morgan Freeman',
    'Bob Gunton',
    'SWilliam Sadler',
    34,
    186
    )

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [24]:
%%sql 
CREATE TABLE Customer2 (
    PersonID char(255) PRIMARY KEY,
    Name char(255),
    address char(255),
    city char(255)
    )

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [25]:
%%sql 
INSERT INTO Customer1 ( PersonID , Name , address , city )
VALUES (
    'OOKIU',
    'TSHIAMO',
    'TTSHIA@GMAIL.COM',
    'TEMBISA'
    )

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [45]:
%%sql
CREATE TABLE Rentals3 (
rental_id INT,
Movie char(255),
Customer1 char(255),
rental_date DATE,
return_date DATE
)

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [46]:
%%sql
INSERT INTO Rentals3 (Rental_id, Movie, Customer1, rental_date, return_date)
VALUES (4928, 'tshiamo', 'Kgaphola', '09/09/24', '12/06/24')

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[]

In [47]:

%sql  SELECT * FROM Rentals3

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(4928, 'tshiamo                                                                                                                                                                                                                                                        ', 'Kgaphola                                                                                                                                                                                                                                                       ', datetime.date(2024, 9, 9), datetime.date(2024, 12, 6))]